---
kind: property
id: P:Autodesk.Revit.DB.FilterElementIdRule.RuleValue
source: html/b7d362be-4b42-7cff-569a-c52b9652b760.htm
---
# Autodesk.Revit.DB.FilterElementIdRule.RuleValue Property

The user-supplied value against which values from a Revit document will be tested.

## Syntax (C#)
```csharp
public ElementId RuleValue { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null